# WinderLegIsTooShortFailure Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..WinderLegIsTooShortFailure Property
BuiltInFailures..::..StairRampFailures Class See Also
---
A winder leg is too short.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId WinderLegIsTooShortFailure { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WinderLegIsTooShortFailure As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ WinderLegIsTooShortFailure {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace